using System;

namespace _06._Repainting
{
    class Program
    {
        static void Main(string[] args)
        {
            //1.Необходимо количество найлон(в кв.м.) -цяло число в интервала[1... 100]
            //2.Необходимо количество боя(в литри) -цяло число в интервала[1…100]
            //3.Количество разредител(в литри) - цяло число в интервала[1…30]
            //4.Часовете, за които майсторите ще свършат работата -цяло число в интервала[1…9]

            int nylon = int.Parse(Console.ReadLine());
            int paint = int.Parse(Console.ReadLine());
            int liter = int.Parse(Console.ReadLine());
            int hours = int.Parse(Console.ReadLine());
            double lastPrice = (nylon + 2) * 1.50 + (paint + (paint*0.1)) * 14.50 + 
                (liter * 5) + 0.40;
            double maistor = (lastPrice * 30 / 100) * hours;
            //Сума за майстори: (213.85 * 30%) * 8 = 513.24 лв.
            double last = lastPrice + maistor;

            Console.WriteLine(last);

            
        }
    }
}

//Напишете програма, която изчислява разходите за ремонта, предвид следните цени:
//•	Предпазен найлон - 1.50 лв. за кв. метър; иска да добави 2 кв.м. найлон
//•	Боя - 14.50 лв. за литър; иска да добави още 10% от количеството боя
//•	Разредител за боя - 5.00 лв. за литър
//разбира се и 0.40 лв. за торбички.

//Сумата, която се заплаща на майсторите за 1 час работа,
//е равна на 30% от сбора на всички разходи за материали.
